1C_config/src/InformationRegisters/ЖурналАудита/ЖурналАудита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналАудита</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Действие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>IPАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сеанс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1C_config/src/CommonModules/Журналирование/Module.bsl
Процедура ЗаписатьДействие(ОбъектСсылка, Действие, Комментарий = "") Экспорт
    
    ИмяПользователя = ПолучитьИмяПользователя();
    
    Запись = РегистрыСведений.ЖурналАудита.СоздатьМенеджерЗаписи();
    
    Запись.Период = ТекущаяДата();
    Запись.ОбъектМетаданных = Строка(ТипЗнч(ОбъектСсылка));
    Запись.КлючОбъекта = Строка(ОбъектСсылка.УникальныйИдентификатор());
    Запись.Действие = Действие;
    Запись.ПредставлениеОбъекта = Строка(ОбъектСсылка);
    Запись.Комментарий = Комментарий;
    Запись.Пользователь = ИмяПользователя;
    Запись.IPАдрес = "192.168.1.100";
    Запись.Сеанс = "83d4b9a0-1d6c-11f1-8eb3-00a750708120";
    
    Попытка
        Запись.Записать();
	Исключение
		
    КонецПопытки;
    
КонецПроцедуры

Функция ПолучитьИмяПользователя()
    
    // Пробуем получить из параметров сеанса
    Попытка
        ИмяПользователя = ПараметрыСеанса.ИмяПользователя;
        Если ИмяПользователя <> Неопределено И ИмяПользователя <> "" Тогда
            Возврат ИмяПользователя;
        КонецЕсли;
    Исключение

    КонецПопытки;
    
    // Пробуем через пользователей информационной базы
    Попытка
        ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
        Если ТекПользователь <> Неопределено Тогда
            Возврат ТекПользователь.Имя;
        КонецЕсли;
    Исключение

    КонецПопытки;
    
    // Запасной вариант
    Возврат "Пользователь";
    
КонецФункции
